<?php

use Illuminate\Database\Seeder;
use App\Position;

class PositionsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $seeders = [
            ['name' => 'Админ'],
            ['name' => 'Директор'],
            ['name' => 'Заместитель директора'],
            ['name' => 'Инспектор по делопроизводству'],
            ['name' => 'Лаборант'],
            ['name' => 'Главный эксперт'],
            ['name' => 'Старший эксперт'],
            ['name' => 'Ведущий эксперт'],
            ['name' => 'Техник'],
            ['name' => 'Руководитель службы кадров'],
            ['name' => 'Помощник руководителя'],
            ['name' => 'Главный бухгалтер'],
            ['name' => 'Расчетный бухгалтер'],
            ['name' => 'Бухгалтер материального стола'],
            ['name' => 'Экономист'],
            ['name' => 'Бухгалтер-кассир'],
            ['name' => 'Системный администратор'],
            ['name' => 'Инженер'],
            ['name' => 'Заведующий лабораторией'],
            ['name' => 'Бухгалтер'],
            ['name' => 'Инженер по государственным закупкам'],
            ['name' => 'Инспектор по кадрам '],
            ['name' => 'Переводчик казахского языка'],
            ['name' => 'Руководитель отдела'],
            ['name' => 'Врач СМЭ'],
            ['name' => 'Главная медицинская сестра'],
            ['name' => 'Медицинская сестра'],
            ['name' => 'Медрегистратор'],
            ['name' => 'Санитар'],
            ['name' => 'Сот-биологиялық бөлімнің санитары'],
            ['name' => 'Врач судебно-медицинский эксперт'],
            ['name' => 'Психолог'],
            ['name' => 'Врач судебно-наркологический эксперт'],
            ['name' => 'Врач судебно-психиатрический эксперт'],
            ['name' => 'Фототехник'],
            ['name' => 'Заведующий складом'],
            ['name' => 'Инженер по обслуживанию холодильного оборудования'],
            ['name' => 'Инженер по обслуживанию компьютерной  техники'],
            ['name' => 'Инженер по обслуживанию медицинского и немедицинского оборудования'],
            ['name' => 'Водитель '],
            ['name' => 'Электрик '],
            ['name' => 'Слесарь-сантехник'],
            ['name' => 'Охранник'],
            ['name' => 'Уборщик помещений'],
            ['name' => 'Дворник '],
            ['name' => 'Эксперт']
        ];

        foreach ($seeders as $seeder) {
            $newSeeder = new Position();

            foreach ($seeder as $row => $value) $newSeeder[$row] = $value;

            $newSeeder->save();
        }
    }
}
